
/*
4.45题：
A. 不正确。当REG为%rsp时，pushq %rsp的行为应该是将原始的%rsp值放入栈顶；而这段代码将%rsp-8的值放入了栈顶。
B. 
    movq REG, -8(%rsp)
    subq $8, %rsp
*/

/*
4.46题：
A. 不正确。当REG为%rsp时，popq %rsp的行为应该是将栈顶的值给%rsp；而这段代码运行后%rsp的值为栈顶值-8。
B. 
    addq $8, %rsp
    movq -8(%rsp), REG
*/

/*
4.51题：
阶段   | iaddq V, rb
------------------------------
取指   | icode:ifun <- M_1[PC]
         rA:rB <- M_1[PC + 1]
         valC <- M_8[PC + 2]
         valP <- PC + 10
------------------------------
译码   | 
         valB <- R[rB]
------------------------------
执行   | valE <- valB + valC
         Set CC
------------------------------
访存   | 
------------------------------
写回   | R[rB] <- valE

------------------------------
更新PC | PC <- valP
*/